Revit 2027 API
ParameterTypeId.NumberSystemDisplayRule Property
 "Display Rule"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId NumberSystemDisplayRule { get; }
Public Shared ReadOnly Property NumberSystemDisplayRule As ForgeTypeId
	Get
public:
static property ForgeTypeId^ NumberSystemDisplayRule {
	ForgeTypeId^ get ();
}
static member NumberSystemDisplayRule : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace